{"evidence_id": "ev_0001", "query": "key features of Python 3.12", "source": {"url": "https://realpython.com/python312-new-features/", "title": "Python 3.12: Cool New Features for You to Try", "publisher": null, "author": null, "published_at": null, "retrieved_at": "2025-12-19T07:48:30.235944"}, "summary": "Python 3.12 introduced several key features and improvements:\n\n1. **Improved Error Messages**: Offers more informative and precise error messages, especially for module imports and class method references, with helpful suggestions.\n2. **More Expressive F-Strings**: F-strings are now parsed by Python's PEG parser, allowing the use of string quotes inside expressions, backslashes, and newlines/comments within curly braces.\n3. **Faster Python**: Includes optimizations like inlined comprehensions, which can improve performance for small iterables, and enhanced specialization of bytecodes.\n4. **Dedicated Type Variable Syntax**: Introduces a new syntax for type variables using square brackets (e.g., `[T]`) in function and class definitions, simplifying generic programming and type annotations.\n5. **Support for Linux `perf` Profiler**: Adds proper support for the Linux kernel's `perf` profiler, enabling more accurate profiling of Python functions.\n6. **Other Features**: Includes internal changes like a per-interpreter GIL (laying groundwork for improved parallelism) and immortal objects (optimizing memory management for truly immutable objects).\n\nThese updates enhance developer experience, performance, and static typing capabilities in Python.", "evidence_items": [], "raw_text_ref": "raw/20251219T074830Z_56100371a3dc.txt", "content_hash": "56100371a3dc3c19757c961ed5e3e778de5c8ff02ed748021aedc1ad0f4b71f9", "tags": []}
{"evidence_id": "ev_0002", "query": "key features of Python 3.12", "source": {"url": "https://www.analyticsvidhya.com/blog/2024/05/python-3-12-new-features-and-improvements/", "title": "Python 3.12 - New Features and Improvements", "publisher": null, "author": null, "published_at": null, "retrieved_at": "2025-12-19T07:48:50.905676"}, "summary": "Python 3.12 introduces several key features enhancing usability, performance, and developer experience. Notable additions include a refined type parameter syntax for more concise generic class and function declarations, supporting type aliases, TypeVarTuple, ParamSpec, and constrained type variables. F-strings are now more flexible, allowing quote reuse, multi-line expressions with comments, and the use of backslashes and Unicode characters, improving error messages. A per-interpreter Global Interpreter Lock (GIL) enables better concurrency by allowing sub-interpreters to have their own GIL, available via the C-API with plans for a Python API in 3.13. Low-impact monitoring for CPython events is introduced for efficient profiling. The buffer protocol is made accessible from Python, and comprehension inlining optimizes dictionary, list, and set comprehensions for performance improvements. Error messages are significantly improved, with NameError, SyntaxError, and ImportError enhancements providing clearer suggestions for debugging. Module improvements include array subscripting, asyncio eager task execution, calendar enums, enhanced csv handling, dis module expansions, float-style formatting in fractions, resource directory support in importlib.resources, inspect enhancements, math module additions, pathlib directory walking and case-sensitive matching, random module updates, and shutil enhancements for error handling and Windows path resolution. SQLite3 gains a CLI and new connection attributes/methods.", "evidence_items": [], "raw_text_ref": "raw/20251219T074850Z_0f45002c0061.txt", "content_hash": "0f45002c00611ba1dfef61582df3438a26844da5d12128b09ad9ee7393c6f8d2", "tags": []}
