{"evidence_id": "ev_0001", "query": "run", "source": {"url": "https://en.wikipedia.org/wiki/Run_(2020_American_film)", "title": "Run (2020 American film)", "publisher": null, "author": null, "published_at": null, "retrieved_at": "2025-12-19T10:13:31.170119"}, "summary": "Run (2020) is a psychological horror thriller directed by Aneesh Chaganty and written by Chaganty and Sev Ohanian, part of the Searching film series. Starring Kiera Allen as disabled teenager Chloe Sherman, the film follows her suspicion that her mother, Diane (Sarah Paulson), is hiding a dark secret. Chloe discovers Diane has been administering Ridocaine (a dog relaxant) instead of her prescribed heart medication, causing Chloe's leg paralysis. After breaking free from Diane's control, Chloe finds evidence of a stolen baby and a death certificate matching her, suggesting she may have been replaced. The climax involves Chloe being drugged, escaping, and ultimately visiting Diane in a correctional facility, where she force-feeds her Ridocaine. The film was produced by Lionsgate, Summit Entertainment, and Hulu, released via streaming on Hulu in 2020 and Netflix internationally in 2021. It received positive reviews, with Rotten Tomatoes approval at 88% and Metacritic score of 67. The film includes references to Chaganty and Ohanian's previous work, with an epilogue explored in the sequel Missing.", "evidence_items": [{"type": "quote", "content": "Run is a 2020 American psychological horror thriller film directed by Aneesh Chaganty, and written by Chaganty and Sev Ohanian.", "location": "Document", "confidence": 1.0}, {"type": "quote", "content": "The film stars Kiera Allen as disabled teenager Chloe Sherman, who begins to suspect that her mother, Diane ( Sarah Paulson ), has been keeping a dark secret about her upbringing.", "location": "Document", "confidence": 1.0}, {"type": "quote", "content": "The film has connections to other films by Chaganty and Ohanian and is the second installment in the filmmaking duo's Searching film series.", "location": "Document", "confidence": 1.0}, {"type": "quote", "content": "Run was released in the United States via streaming on November 20, 2020, on Hulu, and was released in other territories both theatrically and through streaming by Lionsgate International and by Netflix on April 2, 2021.", "location": "Document", "confidence": 1.0}, {"type": "quote", "content": "Chloe suffers from arrhythmia, hemochromatosis, asthma, and diabetes, as well as paralysis in her legs. She uses a wheelchair, takes multiple medications daily, and is homeschooled by her mother.", "location": "Document", "confidence": 1.0}, {"type": "quote", "content": "One morning, while looking through a bag of groceries for chocolate, Chloe finds a prescription bottle of green pills with Diane's name on the label.", "location": "Document", "confidence": 1.0}, {"type": "quote", "content": "The film was a joint production between Summit Entertainment, Lions Gate Films, Search Party Productions, and Hulu Original Films.", "location": "Document", "confidence": 1.0}, {"type": "quote", "content": "Following its debut weekend, Hulu reported that Run was the most-watched original film in the platform's history, as well as the most talked about on Twitter.", "location": "Document", "confidence": 1.0}], "raw_text_ref": "raw/20251219T101331Z_fcbcd3f34e95.txt", "content_hash": "fcbcd3f34e95e0d378f790ea0d009414793cbb776fbbb8765c8b79d3fc938717", "tags": []}
{"evidence_id": "ev_0002", "query": "run", "source": {"url": "https://www.imdb.com/title/tt8633478/", "title": "Run (2020) - IMDb", "publisher": null, "author": null, "published_at": null, "retrieved_at": "2025-12-19T10:13:43.456069"}, "summary": "Chloe is identified as a suicide risk, necessitating constant supervision to prevent self-harm. A 1:1 sitter or continuous video monitoring is recommended. Environmentally, the room must be secured by removing potential hazards such as sharp objects, wires, ties, cords, and hospital linens to prevent methods like hanging. These precautions are supported by the nurse/doctor's acknowledgment of the risk, evidenced by restricting Chloe's access to a pen. However, a critical error occurs when Chloe is left unattended, despite these established safety measures. The document emphasizes the importance of continuous observation and environmental safety to mitigate suicide risk, highlighting the failure in Chloe's case due to inadequate staffing.", "evidence_items": [{"type": "quote", "content": "As a suicide risk, Chloe should have a 1:1 sitter at all times- a staff member, or at the least, a video monitor, to make sure she doesn't try to harm herself.", "location": null, "confidence": null}, {"type": "quote", "content": "The room should have been cleared of any sharp objects, as well as wires, ties, cords, hospital linens, etc, that could be used to make a noose.", "location": null, "confidence": null}, {"type": "quote", "content": "The nurse/doctor even acknowledges this risk by not allowing Chloe to use her pen, but commits a grave error leaving her alone in the room.", "location": null, "confidence": null}], "raw_text_ref": "raw/20251219T101343Z_7a2d3a327fe3.txt", "content_hash": "7a2d3a327fe3c1d9b37eb0f129e379f070218d446909bc138d99cd8174296977", "tags": []}
